import { FaLongArrowAltLeft } from "react-icons/fa"
import stop from "./../../../assets/Images/Stop.png"
export default function Titles() {
  const titels =[
    {
      num:"١",
      title:' مقدمة عن البيع ( تعريفه، أهميته، مسؤولياته)',
      dis:"علشان من الأول خالص تكون عقليه محترمه",
    },
    {
      num:"٢",
      title:' ثمان صفات لضمان فشلك في المبيعات',
      dis:"علشان تتجنبهم، وتاخد خلاصة فشل السنين بسرعه، وماتكررش الاخطاء دي",
    },
    {
      num:"٣",
      title:' ١٠ صفات يتحلى بهم رجل المبيعات الناجح ',
      dis:"أهم الصفات اللي لازم تكون في شخصيتك ، لأن البيع مش بس مهارات ، ده شخصيه قبل مايكون مهارات",
    },
    {
      num:"٤",
      title:' إجابة أبرز سؤالين حول مهنة المبيعات ',
      dis:"وسؤال أخر البيع فن أم علم ؟",
    },
    {
      num:"٥",
      title:'كيفية طرح الأسألة البيعيه',
      dis:"تسأل تقول ايه لما تكون عاوز تعرف ايه؟ ( كيف نبيع بالسؤال ) وازاي تعرف كل حاجه عن أي شخص بتتكلم معاه علشان تعرف تبيعله اللي أنت عاوزه ؟",
    },
    {
      num:"٦",
      title:' مستويات البيع الثلاثه.',
      dis:"   المستوى الاول : ازاي تبيع حاجه عندك لحد بيسأل عليها؟ المستوى الثاني : ازاي تبيع حاجه عندك لحد عاوز حاجه شبهها بس مش عاوزها هي ؟ المستوى الثالث : ازاي تبيع حاجه عندك لحد أصلا مش عاوزها ؟!!.",
    },
    {
      num:"٧",
      title:'كيف نصمم ميزة تنافسية ونقطة بيع فريدة لشركتنا ؟',
      dis:"وهنا هتتعلم ازاي تبيع مهما كانت المنافسه شرسه (بس دي خطوة أصلا قبل البيع)",
    },
    {
      num:"٨",
      title:'كيف نبيع عن طريق الميزة التنافسية .',
      dis:"ازاي بقى تستخدم الميزه دي في البيع ؟",
    },
    {
      num:"٩",
      title:' الفرق بين المستخدم والمشتري وصاحب القرار',
      dis:"لازم تفرق أنت بتتكلم مع مين ، علشان كل حد فيهم ليه بيعه بطريقه معينه ..",
    },
    {
      num:"١٠",
      title:'.اعتراضات العملاء السبعه وكيفية التعامل مع كل الاعتراضات وتحيدها',
      dis:"( خصوصا اعتراض السعر ) . كل الاعتراضات ازاي تفندها ، وتبيع بكل سهوله؟",
    },
    {
      num:"١١",
      title:' كيف تكتشف ان العميل معترض دون ان يخبرك انه معترض ؟',
      dis:"ازاي تعرفه من لغة جسده ؟",
    },
    {
      num:"١٢",
      title:' كيفية البيع عن طريق التليفون ؟',
      dis:"هتبيع حتى لو العميل مش واقف قدامك !",
    },
    {
      num:"١٣",
      title:' تحليل الشخصية وكيفية التعامل مع كل شخصية بعد تحليلها لاتمام الصفقات البيعية ؟ ',
      dis:"هتقدر تقرأ العملاء وتستخدم المواقف لصالحك بشكل ذكي ، ومختلف .",
    },
    {
      num:"١٤",
      title:'أخطر ماتوصل اليه علم النفس في التلاعب بعقول البشر !',
      dis:" الاستجابات السلوكية السبعة للبشر ، وكيف نستخدم هذا النظام البشري المتكامل لصالحنا بدل ان يعمل ضدنا ؟ "
    },
    {
      num:"١٥",
      title:' استخدام المهارات الذهنية والبيع عن طريق الحواس ',
      dis:"ازاي تستخدم مهارات العميل الذهنيه علشان تخدم هدفك أنت ؟.",
    },
    {
      num:"١٦",
      title:' خمس نصائح ليتذكرك العميل بشكل دائم .',
      dis:"ازاي يفضل فاكرك حتى لو ماشتراش منك علشان يرجعلك تاني ؟",
    },
    {
      num:"١٧",
      title:'كلمات تقدر تخلص بيها أي بيعه بسهوله .',
      dis:"كلمات لها القدره على انهاء أي صفقة ، وكلمات أخرى قادره عن اهدار اي صفقه ! ",
    },
    {
      num:"١٨",
      title:' الاغلاق الهادئ',
      dis:"( اتمام الصفقات في اللحظات الاخيره ) اللحظة الحاسمه ، ازاي نتعامل فيها بكل هدوء !",
    },
    {
      num:"١٩",
      title:'خمس وصايا لعميل دائم مدى الحياة .',
      dis:"ازاي تخلليه يشتري منك 100 مره",
    },
    {
      num:"٢٠",
      title:' تسلسل الخطوات البيعية العشرة',
      dis:"الخريطه الكامله لخطوات البيع الفعال",
    },
    {
      num:"٢١",
      title:'من هو مدير المبيعات ومادوره، وكيف نقيسه .',
      dis:"لازم تعرف دورك الفعلي ايه علشان تعرف تقدمه صح",
    },
    {
      num:"٢٢",
      title:'كيف نحدد ونضع مستهدف المبيعات ',
      dis:"الشركات بتحط التارجت بتاعها ازاي ؟",
    },
    {
      num:"٢٣",
      title:' كيف نتنبأ بالمبيعات',
      dis:"ازاي تقول هنبيع بكام ، وتبيع فعلا بالرقم ده ",
    },
    {
      num:"٢٤",
      title:' تحديد عدد افراد فريق البيع وتنظيمهم وتوزيعهم ',
      dis:"أنت محتاج ايه ، وكام علشان تحقق هدفك ؟",
    },
    {
      num:"٢٥",
      title:'كيف يتم احتساب العمولات ، وكيف يتم تحديد التارجت البيعي للأفراد، وللمؤسسة ككل ؟ ',
      dis:"ازاي احط تارجت لكل واحد في فريقي ، وازاي أعمل نظام عموله يحفزهم باستمرار ؟",
    },
    {
      num:"٢٦",
      title:'الاشراف والتحفيز على فريق البيع ',
      dis:"ازاي أكون مدير وقائد شاطر قادر يحفز الموظفين بتوعه",
    },
    {
      num:"٢٧",
      title:' وصايا الختام',
      dis:"وأخيرا ",
    },
   
  ]
  return (
    <section className="py-7 container mx-auto">
      <div className="flex items-center justify-center mb-6">
        <button className="text-xl font-semibold md:text-4xl bg-[#FFCC01] px-10 py-5 rounded-full m-3 hover:bg-[#eaca4a]" >الحق خصم ال early birds لاول <span className=" text-red-600">50 مشترك </span> , ولمده <span className="text-red-600">7 ايام </span> فقط
      </button>
      <img src={stop} className="hidden md:block" alt="" />
      </div>
      <hr className="mb-6 mx-[7%] border-black border-2 "/>
      <div className="flex items-center mb-6 bg-[#B8DFF4] w-fit text-xl lg:text-5xl py-3 px-6 rounded-md mx-10" >
      <FaLongArrowAltLeft />
        <h1> 27عنوان قادرين على تغيير مستواك المادي تماما </h1>
      </div>
      <div className="grid grid-cols-1 sm:grid-cols-2 lg:grid-cols-3 gap-6 px-10">
      {titels.map((topic, index) => (
          <div
            key={index}
            className="bg-white shadow-md rounded-lg p-4 hover:shadow-xl hover:scale-105 transition-all duration-300"
          >
            <div className="text-blue-500 font-bold text-xl mb-2">{topic.num}</div>
            <h2 className="text-lg font-semibold text-gray-800 mb-2">
              {topic.title}
            </h2>
            <p className="text-gray-600">{topic.dis}</p>
          </div>
        ))}
      </div>
    </section>
  )
}
