import nadaTarek from "./../../../assets/Images/nadatarek.jpg"
import hebaBadr from "./../../../assets/Images/hepaBadr.jpg"
import mohamedAlbana from "./../../../assets/Images/mohamedAlbana.jpg"
import saraEslam from "./../../../assets/Images/saraEslam.jpg"
import mahmoudAlsbrawym from "./../../../assets/Images/mahmoudAlshbrawy.jpg"
import mahmoudMonir from "./../../../assets/Images/mahmoudMonir.jpg"
import ahmedAlshawr from "./../../../assets/Images/ahmedAlshawr.jpg"
import mohamedReda from "./../../../assets/Images/mohamedReda.jpg"
import AbdAlrahmanAlsyad from "./../../../assets/Images/AbdAlrahmanAlsyad.jpg"
import mennaAlsawy from "./../../../assets/Images/mennaElsawy.jpg"
import nehalElsaied from "./../../../assets/Images/nehalElsaied.jpg"
import AhmedHmam from "./../../../assets/Images/AhmedHmam.jpg"
import mohamedHabib from "./../../../assets/Images/mohamedHabib.jpg"
import hossam from "./../../../assets/Images/hossam.jpg"
import mohamedAlAraby from "./../../../assets/Images/mohamedAlAraby.jpg"
import AshrafRefaat from "./../../../assets/Images/AshrafRefaat.jpg"
import DalaiOmar from "./../../../assets/Images/DaliaOmar.jpg"
import AimanAboBakr from "./../../../assets/Images/ahmedAlshawr.jpg"
import { useState } from "react"


export default function ClientFeadBack() {
    const data = [
        {
            post: `رحله بدأت من 9 شهور و خلصت الحمد الله دبلومه البزنس اللى بشمهندس من بعدها قرر يوقف😂
و حقيقى كان 9 شهور فيهم تغير كبير مش  بس على مستوى الشغل و لكن  على المستوى الشخصى كمان 
9 شهور كل يوم جمعة عن مدة لا تقل عن  6 ساعات و اللى اوقات كانت بتوصل لى 9  ساعات  متخيلين الرقم😳 
دبلومة خلتني اعرف ازاي ابدا بزنس من بداية الفكره لغايه ما مشروعك يظهر للناس و يبدأ يتعرف و ازاي تجذب العميل انه يجيلك و يفضل عميلك الدائم💸  
مواضيع الدبلومه كلها كانت مهمه من اول 
Business model
 marketing plan - pricing - content creation- sales- business operation system- planning- Facebook ads - leadership- customer service
 كان اكتر موضوع  مستنياه هو content creation و ده بسبب انه شغفى و شغلى  بس فى دبلومه اكتشفت شغفى لحاجات تانيه بجانب الكونتيت و اكتشفت ان كل المواضيع دى مهم للكونينت لان لما تفهم بزنس بتاعك صح و تعرف تستهدف عملاء صح و تفهم شخصياتهم و ازاي تدير الفريق و ازاي تبيع خدمتك و ازاي تعمل ماركتنج بلان
 كل ده هيخليك لما تيجي تعمل كونتيت بلان هتقدر فعلا تكتبه و ببقي متفصل علي مقاس البزنس بتاعك و اكنك انت دخلت دماغ العميل و عرفت هو محتاج ايه و ايه لما يسمعه هياخد قرار الشراء و يبقى مخلص للبراند بتاعك
 نظرتى  لل content creation اتغيرت كتير و خلينى اشبهلكم وجهه نظرى  و ببساطه هى فكره البزنس و التخطيط و ماركتنج بلان زى بظبط جسم الإنسان و content creation بشكل عام هو القلب اللي مع أول نبضه البزنس بتاعك بيبدأ يعيش يعني بيبدأ الناس تعرفه
فى دبلومه بشمهندس وليد مكنش بينقل لينا مجرد بس علم و تجارب شخصيه بس كمان كان همه اننا نغير mindset بتاعتنا و نطور اكتر على الجانب المهني و الشخصى و زى ما عودنا فى الدبلومة و اكتر جملة  بشمهندس كان بيكررها ليس السلاح و لكنه الساعد 
في النهاية احب اشكر بشمهندس وليد على تعبه معانا طول فتره 9 شهور  سواء فى الدبلومة او الاستشارات و  على طريقته البسيطة في توصيل المعلومة  و على اصراره انه مفيش اي حد يطلع من الدبلومة غير و هو فاهم كل حاجه اتشرحت فعلا بشمهندس وليد نموذج للأشخاص اللى بتحب ما تعمل ربنا يزيدك من علمه و تقدر تفيد ناس كتير 🫶🏻
اللى محضرش الدبلومه مع بشمهندس وليد فاته كتير فعلا
و حقيقي مهما اتكلمت عن استفاده من الدبلومة و من كل موضع اتشرح من هيكفى بوست واحد هنحتاج نعمل سلسله الاستفادات الحنبلية و ننزلها كل أسبوع 😂♥️
و حابه اشكر كل واحد قبلته فى الدبلومة  لان استفدت من كل شخص فيكو على مستوى الشخصى قبل المستوى المهنى و بتمنى ليكم النجاح و التوفيق فى حياتكم`,
            client: `ندي طاىق`,
            postLink: "https://www.facebook.com/story.php?story_fbid=2299110003757157&id=100009745392768&rdid=b6nXXOKwqm7OerG6",
            img: nadaTarek
        },
        {
            post: `بعد ٩ شهور من دراسة دبلومة البيزنس  والسفر من القاهرة للمنصورة 
ليه برشح دبلومة البيزنس لأي حد حابب يستثمر في نفسه ؟
 انا حضرت مع الباشمهندس كورس في مهارات العرض وعجبتني طريقته في تناول المحتوى وعرضه وده شجعني للدخول معاه في دبلومة البيزنس 
وكان أهم حاجتين بالنسبة لي: إني أخد مع شخص كفء في شرح المادة العلمية 
،وإنه يكون شغال على الأرض وعنده نتايج في تطبيق العلم ده 
وده عرفته قبل ما اشترك إنه فعلا بيدير أكتر من حاجة وطبق العلم كمان بشكل عملي من خلال أكتر من مشروع وده شجعني إني أشترك في الدبلومة
وهنا كانت المشكلة لأن معلوماتي تقريبا صفر في معظم الحاجات اللي هتتشرح حتى المصطلحات اللي بيستخدموها ما اعرفهاش
 فالباشمهندس اتفق معايا إني أدرس كورس  في الأول مجانا اذاكره ويمتحنني فيه عشان يقبلني لو نجحت هشترك في الدبلومة ولو ما نجحتش مش هينفع أشترك في الدبلومة
نرجع لإجابة السؤال : ليه برشح دبلومة البيزنس لأي حد حابب يستثمر في نفسه ؟
١.اول حاجة انت بتتعلم فيها ازاي تكون عقلية النمو  وبتصحح فيها أفكارك نفسك وعن الشغل وسوق العمل .
٢. بتتعلم الأخطاء اللي الشركات عملتها علشان ما تعملهاش وإيه أهم الحاجات الصح اللي مفروض تلتزم بيها علشان تنمو وتتوسع وده بالتالي بيحافظ على فلوس ووقت ومجهود .
٣.إنك مش بتسمع كلام غير قابل للتطبيق لا انت بتشوف نماذج قائمة بالفعل لبزنس ولمشكلات تم حلها سواء لشركات محلية أو عالمية .
٤.إن الماتريال بتتعمل بشكل يناسب المجالات المختلفة علشان نقدر نطبق عليها وطبعا اللي عندهم بزنس قائم بالفعل في المحاضرة طبقوا ده وحققوا نتايج .
٥. بيتطلب منك مهام tasks للتطبيق على كل حاجة اتعلمتها علشان يتأكد من إنك فاهم صح ويعدل لك أي أخطاء .
وكان بيتخصص لها ايام من المحاضرات منفردة لمراجعة المهام والتعديل عليها لأن العملي مهم جدا في الدبلومة
٥. بتتعلم فيها ازاي تسوق لمنتجاتك وإيه أكتر مكان مناسب لمنتجك علشان تسوق فيه 
وازاي تقلل تكلفة التسويق وتحسن النتايج وكمان ازاي تتواصل مع العملاء الغاضبين او المعترضين على السعر.
وطبعا لو حابب التسويق يكون شغلك فالدبلومة دي مناسبة ليك 
٦. لو انت مهتم بالمحتوى فهتتعلم فيها ازاي تسوق لمنتجك عن طريق كتابة المحتوى وازاي تكون كاتب محتوى أصلا لو هتشتغل في كصانع محتوى.
٧. ازاي تقود الناس وتقود مجموعات العمل وازاي تكون فعلا قائد فعال.
٨.المصداقية في عرض المعلومات لأن لما  اللي بيدرسك يكون عنده مصداقية ومرجعية موثوقة فده بينعكس إيجابيا عليك.
 والحقيقة إن باشمهندس وليد عنده مرجعية شرعية واضحة جدا في المحاضرات .
وطبعا عارفين الفكر الغربي مرجعيته الوحيدة المكسب والخسارة فهو هنا كان بيبين الإشكالية الموجودة دينيا وأخلاقيا ولو لها تأثير على البيزنس على المدى الطويل
٩. الباشمهندس بيقدم استشارات مجانية طول فترة التدريب وكان حاطط مواعيد متاحة لأي حد عنده استشارة في شغله
 وده غير لما كنا بنسأله  وقت المحاضرات لأن وجود موجه أو داعم  (mentor) معاك بيفرق في مستوى تقدمك أو ثقتك بنفسك .
١٠.  لما احتاجنا ناخد السوشيال ميديا  وشات جي بي تي بدأ باشمهندس مصطفى يدرس لنا 
وده لرغبته إنه يوفر لنا الخبراء في المجال- مع إنه بيشتغل سوشيال ميديا وشات جي بي تي - أكتر من إنه هو اللي يقوم بكل الأدوار .
١١. متمكن في مراعاة الآخرين ونفسياتهم
ومع إن اننا في كورس بيتكلم عن الشغل وسوق العمل لكن احنا بشر
وكان دايما يأكد على أهمية معاملة الناس برفق والاهتمام بيهم وبأحوالهم 
والحقيقة كان النموذج لده لما حد يعطل او يغيب كان بيشوف فين المشكلة ويحاول يساعده 
١٢. هيشجعك ويحفزك ويديك كتب مجانا لو فزت وطبعا كلنا عارفين ان الكتب غليت اوي
طبعا زمايلي في الكورس عرضوا الموضوعات بشكل وافي وحبيت طريقتهم لكن انا هقولها هنا باختصار 
احنا درسنا ازاي تعمل نموذج للعمل التجاري من الصفر ودرسنا ازاي تسعر المنتجات والتسويق اللي هنحتاجه طبعا لما نشتغل
 وكمان درسنا ازاي تدير البيزنس  وامتى تقول أنا لازم انكمش أو أتوسع أو حتى أخرج من السوق وطرق كل ده 
ودرسنا ازاي تعمل محتوى جذاب وازاي تتعامل مع فريقك وده كان في القيادة وإيه أصلا مفهوم القيادة والفرق بين أنماط القادة وازاي تدير الناس حواليك وتتقي ربنا فيهم
 كمان درسنا ازاي تعمل إعلانات على السوشيال ميديا وازاي تستخدم شات جي بي تي في شغلك وتحقق أفضل نتايج 
وقبل كل ده غيرنا العقلية واتعلمنا المفاهيم الصح للبيزنس واتعرفنا على نفسنا وأنماط شخصياتنا .
في النهاية الدبلومة هتفيدك في حياتك بصفة عامة مش بس على المستوى المهني. 
#الباشماركتير
#هندسةالبيزنس`,
            client: ` هبه بدر`,
            postLink: `https://www.facebook.com/story.php?story_fbid=122218809728030263&id=61550907901927&rdid=gczdXmgqRWYIaxQK`,
            img: hebaBadr
        },
        {
            post: `ساعات كتيييييييييير لتاني مره علي التوالي مع وليد الحنبلي 🕦
خلصوا و محستش بيهم، علشان كلهم زي الفيديو دا اللي كنا بنتكلم فيه عن التخطيط و تحديد البدائل و ايه العناصر اللي نقيم بيها البدائل دي …. 
🔸 ساعات كتير كلها معلومات بتتقاال بطريقه حماسيه، عمرك ما تزهق و انت بتسمعها و بتحفزك انك تقوم حالا تشتغل و تطور 
دبلومه الاداره "leadership and Management" اتعلمت فيها ازاي 
•احط رؤيه و هدف
•اختار الشخص الصح و احطه في المكان الصح
•ابقي مدير و اتقي الله في الناس اللي هديرها
•لما اعمل مشروع او امسك project او اكون في منصب اداري ابقي قادر اعمل plan و انفذها صح 
•ادير الناس و القرارات و الاجتماعات لحد اداره التفاعلات الصعبه “Conflict Management” 
•احفر نفسي علشان اكون قادر اخلق بيئه محفزه للناس اللي شغاله معايه 
و اخيرا ازاي اكون قادر اعمل presentation قوي ايا كان عدد الاشخاص اللي قدامي 🎙️
تفاصيل كتير و تاسكات اكتر (اي نعم متعملش منهم اي حاجه بس هما كانو كتير) 🤫
متحمس اطبق كل دا و متاكد ان كل معلومه اخدتها هيجي الوقت و احتاجها  💪🏻
شكرا يا باشمهندس WWalid Elhanbly🥹
#الباش_ماركتير 
#هندسة_البيزنس`,
            client: `محمد البنا`,
            postLink: `https://www.facebook.com/story.php?story_fbid=6970050366350712&id=100000374525469&rdid=wZYCjXoOZz1ic7t6`,
            img: mohamedAlbana
        },
        {
            post: `٩ شهور حوالي ٢٠٠ ساعه شرح ! 😀
حقيقي الدبلومه كانت ثريه جدا جدا بالمعلومات ومليئه بالمذاكرة والتاسكات التي لا تنتهي 🫠
ولااكن على ما يبدوا ان الحمدلله تمت على خير وقدر ولطف والف الف مبرووك 😂😌
-الدبلومه بدأت من اول يعني اي بيزنس وازاي نعمل BMC للمشروع بتاعنا بكل فتفوته فيه فعلا مرورا ب ازاي نعمل ماركيتينج بلان ونكتب محتوى ينقلنا في حته تانيه حرفيا ..
- ازاي نسعر منتجاتنا وخدماتنا بالشكل المناسب ودي حاجه بتحير كتيير مننا؟
- ازاي نقدم خدمه عملاء حقيقيه لعملائنا ونقيس مدى رضاهم عن الخدمه ؟وده كان من اكتر الحاجات المهمه جدا جدا .
- التخطيط الاستراتيجي و التشغيلي وازاي نحط خطه تفصيلية لكل حاجه وازاي نعمل BOS لكل تفصيله في البيزنس بتاعك وطبعا طبعا ازاي نحل مشاكلنا ونعرف اساسا انها مشكله !!
- بعد كل ده نروح بقا للمبيعات والبيع ودي الخطوه الي كلنا بنستناها 😁 عرفنا من اول ازاي نبيع وليه لحد الاعتراضات وازاي نتعامل معاها وازاي نحط هدف المبيعات و نستلم التقارير و احفز فريق المبيعات وتفاصيل كتير فارقه في كل مشروع فعلا.
- عملنا كل ده نعرف بقاا أمته نتوسع و أمته نقفل و اعرف ازاي البيزنس بتاعي ف انهي مرحله علشان اتعامل على هذا الأساس 🫡
وختامنا ب ازاي نكون قاده حقيقين؟ وازاي نفوض المهام علشان كل حاجه تمشي بسلاسه حتى وانت مش موجود ! 😌
حقيقي المحتوى كان دسم جدا جدا ولا يكفي اني اتكلم عنه في بوست بس دي مجرد بعض العناوين للي درسناه ويارب يعيننا على التطبيق وينفعنا بما تعلمنا اللهم آمين ويجعله في ميزان حسناتنا 🤍✨️
باشمهندس وليد حقيقي كل معلومه كان بيقولنا ازاي نطبقها وكنا بنتناقش في التاسكات و نطبق ونراجع ودي اكتر حاجه بتكون فارقه بالنسبالي التفاعل والتطبيق ربنا ينفع بيه ديما يارب.
وطبعا كفايه اني اتعرفت على ناس اقل ما يقال عنهم انهم متميزين جدا كل واحد في مجاله وسعيه اتعلمنا من بعض كتير جدا 🫶🏻♥️`,
            client: `ساره اكرم`,
            postLink: `https://www.facebook.com/story.php?story_fbid=8367562496697223&id=100003306666534&rdid=JeJDIe4QmxjW5Cwr`,
            img: saraEslam
        },
        {
            post: `دبلومه 9 شهور كاملين متوقعين هنكون بندرس فيها ايه؟🤔
عرفتها بالصدفة وانا بقلب ف التايم لاين قبل بدايها بأقل من 24 ساعه!! 
كلمت صديق ليا ووصلني بوليد و سألته سؤال عشوائي، انا هستفيد ايه من الدبلومة؟ 
مش هقولكم رده بس هقولكم ال استفدته وخلاني أكَبَر الشركة ل ٣ أضعافها تقريبا في المدة دي! 
بدأنا بنموذج العمل التجاري "BMC”، ودا جدول بيعطيك نظرة شاملة على البيزنس بتاعك لأنه بيحدد عناصره الرئیسیة زي "مين عملائك؟، هتقدملهم ايه؟, هتوصلهم ازاي؟, علاقتك بيهم، الأنشطة ال هتعملها، الإیرادات، التكالیف".
ودا هيساعدك في "اتخاذ القرارات ، استغلال الموارد، تقلیل المخاطر"🛂.
بعد كدا التسويق، موضوع كبيير لكن ببساطة دا ال هيعملك وضع ف السوق لأنه هيساعدك في تحديد "عملائك، وافضل الطرق للوصول لهم" وبيه تدير "العروض، والمنتجات المقدمة، والاسعار المناسبة للسوق" والأهم ازاي تعمل ميزه تنافسية تتميز بيها، وكل دا هيوصلك لانك تبقا براند معروف📈.
بعد كدا صناعة المحتوى، قضينا فيه اكتر من 16 ساعة!
مهارة لازم تكون عند أي صاحب بيزنس.
عرفنا فيها ازاي "أعتمد على المحتوى من غير اعلانات ممولة، واكتب محتوى يبقا من Assets الشركة ال هتفضل ت Go on وتجيب leads لواحدها"📣 .
جالنا ليدز؟، نبيعلهم بقا، المبيعات “sales” مهارة لو عندك هتحللك ٨٠٪؜ من مشاكلك.
اتعلمت فيه حاجات كتير جدااا أهمهم "ازاي أعرف العميل الحقيقي من ال هيضيع وقتي، وعرفنا ٧ أنواع لاعتراضات العملاء وازاي نتعامل مع كل واحد، وازاي أدير البياعين، وأحدد لهم التارجت صح، وازاي أقيس أدائهم واحفزهم"💫.
كدا ناقصنا نتابع عملائنا بخدمة عملاء، ودا ال مش موجود ف كل شركات مصر تقريباً. 
بس لو عرفت ان تكلفة كسبك لعميل جديد = ٦ أضعاف التكلفة عشان ترَجَع عميل قديم هتبني لها سيستم كامل لخدمة العملاء !
هتعرف فيها تفاصيل كتيير زي "ايه 
 هي خدمة العملاء؟ وليه مهمه؟، وازاي تعرف ان بتقدمها صح؟، ازاي تتعامل مع العميل لما يتعصب!" 
وصحيح العميل مش دايما على حق، وعشان كدا اتعلمنا ازاي نتعامل في الحالة دي 😉.
وعشان نثبت ع المستوى دا تحت أي ظرف لازم نعمل نظام للعمليات "BOS”، دا فيه بتحدد المهام ال بيعملها كل شخص بالتفصيل عشان مفيش مهمة تقف ف النص لو انت مش موجود. ودا هيساعدك في "تبسیط المهام ووضوحها، ثبات الجودة، التوسع والانتشار، متابعة الفريق وعليه هتاخد قرارات كتير"🧐.
باقي اننا نعرف وضعنا ف السوق ورايحين ع فين و دا بتحليل الشركة، وهنا اتكلمنا عن طرق كتير اهمها الSWOT، وعرفت ان ال الشركات بتعمله ملوش علاقه ب ال SWOT اصلا، دي اهم طرق التحلیل ال بتحدد نقاط القوة والضعف داخل الشركة، والفرص الخارجيه عشان تستغلها، والتھدیدات ال ممكن تعطلك، و في مراحل متقدمه منه بتدمج بين العوامل دي وبتطلعلك ميزه تنافسية بتكتسح بيها السوق📊.
وأكيد مش هيفوتنا "دراسة الجدوى" وبيه هتعرف تتوقع الاوضاع المالية بناء على تحليل الشركة و السوق في السنين ال فاتت. وتقدر توقع "الإیرادات، التكالیف، الكاش فلو، والربحیة بمرور الوقت" وكسب ثقة المستثمرین، وبيفتحلك طرق ربح جديدة💸.
مسك الختام كان بالادارة، وفيها هتعرف ايه معنى القائد اصلا؟ وازاي تطلع من تحتك قاده مش اتباع!، وتعرف تحلل شخصية كل فرد في الفريق وتخليه شغال وكأنه صاحب الشركة، وعرفنا ان التفويض مش مجرد انك ترمي التاسك وتمشي.
 فيه خطوات بتتعمل قبل التفويض، ووقت التفويض ، وبعد التفويض، ومع الوقت هتلاقيك كونت مؤسسة ماشيه لوحدها على نفس النُسك حتى لو أنت مش موجود.😌
عارف ان الكلام كتير بس حاولت أوفي الراجل الطيب دا جزء من حقه على تعبه معانا الفترة دي وأكيد فاكر زمايلي ال كانوا معايا طول المدة دي وكنت محظوظ بوجودي وسطهم واتعرفت عليهم في الدبلومة العظيمة دي♥️🥰
#الباش_ماركتير #هندسة_البيزنس`,
            client: `محمود الشبراوي`,
            postLink: `https://www.facebook.com/story.php?story_fbid=7844015212366316&id=100002737466913&rdid=AYN9tl5mMJE5p1m8`,
            img: mahmoudAlsbrawym
        },
        {
            post: `حابب أشارك معاكم فيدباك عن واحد من أكتر الناس أمانة وإخلاص في نقل المعلومة، Walid Elhanbly . خلال ٩ شهور في دبلومة البيزنس، شفت قد إيه الراجل دا بيبذل مجهود جبار علشان يعلم ويوصل المعلومات بكل تفاصيلها. 🙌
أنا مش سهل حاجة تعجبني أو تدخل دماغي، لكن حقيقي الدبلومة دي كانت مليانة "زُبد" ودرر في عالم البيزنس! ✨
بدأنا من:
نموذج العمل التجاري
الخطة التسويقية
كتابة المحتوى
التسعير
المبيعات
إدارة العمليات
التخطيط
الإعلانات
خدمة العملاء
وختامًا بموضوعي المفضل القيادة. 🎯
كل موضوع كنا بنحسه عملي وبسيط، مش مجرد كلام نظري من الكتب. لا، دا وليد كان بيشرح لنا كل حاجة من تجربته الشخصية اللي عاشها في السوق. 💼 ودايمًا كان بيطلب مننا نطبق على مشاريعنا ونتناقش معاه، ودي كانت نقطة التحول في التدريب. 🛠️
أكتر مفاهيم استفدت منها:
1️⃣ العميل هو البداية والنهاية في أي بيزنس. لازم تفهمه وتخدمه صح.
2️⃣ الناس مش بتشتري المنتج أو الخدمة، الناس بتشتري الأمل والتوقع اللي بيوفره المنتج أو الخدمة. 
3️⃣ لازم يكون عندك حاجتين أساسيتين في أي بيزنس:
- قيمة حقيقية تقدمها. - نظام عمل منظم (BOS) يوصل شركتك للنجاح. 
4️⃣ الخطاب الوحيد اللي يشد الناس هو لما تتكلم معاهم عن نفسهم.
5️⃣ أخطر حاجة في البيزنس هي الاعتماد على رقم واحد (منتج واحد، مورد واحد، إلخ).
6️⃣ التسعير الصح مش مجرد أرقام، هو اللي يضمنلك إيرادات وتغطية التكاليف + ربح منطقي. 
7️⃣ البياع الشاطر مش مجرد بياع، هو شخص بيضيف قيمة للمنتج.
8️⃣ القيادة هي إنك تفكر كعبقري، تحكم كملك، وتعمل كعبد. 
اما ليه بنقود الناس اصلا ؟ علشان نخدمهم.
الدبلومة دي غيرت فيا كتير جدًا، مش بس معلومات، لكن كمان سلوك ومهارات جديدة. بدأت أطبق كل اللي اتعلمته على طول وأشوف نتايجه في شغلي وحياتي. 💪
كمان، المجتمع اللي اتبني حوالينا خلال الدبلومة كان رائع، مليان ناس مميزة، وكلنا استفدنا من بعض كتير.
الدبلومة دي مش مجرد كورس، دي تجربة بتغير حياتك حرفيًا. شكرًا ليك يا باشمهندس وليد، على كل حاجة قدمتها وعلى تعبك معانا. 🙏❤️`,
            client: `محمود منير`,
            postLink: `https://www.facebook.com/story.php?story_fbid=1621155812140571&id=100027385038628&rdid=qVXSQPRpvgWIW7cG`,
            img: mahmoudMonir
        },
        {
            post: `في حياتنا بنتعلم كتير من خبرات الآخرين وصحبتهم يمكن أكثر من الطرق التقليدية وأسرع من التجربة والخطأ.
الحمد لله ربنا من عليا وأكرمني بإتمام دبلومة ريادة الأعمال مع المهندس وليد الحنبلي Walid Elhanbly  اللي استغرقت حوالي 9 أشهر وما يقرب من 200 ساعة شرح، كان هدفي هو إحاطة نفسي بخبراء علشان أستفيد من تجاربهم وأختصر على نفسي المسار.
قبل ما أنضم ، كنت بطرح ثلاث أسئلة رئيسية:
1. هل المدرب كفء ؟
2. هل الموضوعات مهمة ونافعة وعملية بالنسبة لي؟
3. هل وقتي يسمح بذلك؟
الإجابة على السؤال الأول كانت واضحة بالنسبالي لأني اشتغلت سابقًا مع المهندس وليد، وكنت على ثقة تامة في كفاءته وخُلقه واهتمامه بنقل المعرفة بأمانة، أما بالنسبة للسؤالين الآخرين، فبعد استشارة واستخارة وتفكير عميق مستغرق ومع مرور الوقت كنت بزداد يقينًا بأن الدبلومة كانت قرار صائب الحمد لله، كل موضوع درستُه زاد من فهمي وتوسعت مداركي بشكل كبير.
الدبلومة تناولت موضوعات متنوعة مثل نموذج العمل التجاري، خطة التسويق، صناعة المحتوى، التسعير، المبيعات وخدمة العملاء، والتخطيط الاستراتيجي، إلى جانب إعلانات فيسبوك والقيادة. 
 بعض هذه الموضوعات كان له تأثير مباشر على عملي اليومي، خاصة في مجال المبيعات والقيادة والتخطيط، حيث تعلمت الكثير عن التعامل مع الناس وفهم النفسيات المختلفة، كمان حبيت جدا صناعة المحتوى وكنت مستمتع جدا بدراسة التسويق. 
المهندس وليد كان دائمًا يقدم مصادر خارجية، ويشجعنا على الرجوع للكتب والمراجع، مما أضاف عمقًا للدراسة. 
الكورس جمع بين المعلومات النظرية المستقاة من الكتب وبين التطبيق العملي القوي ونقل الخبرة الغزيرة للمدرب والمشاركين. 
كل جلسة كانت تشمل نقاشات عملية وتطبيقات واقعية، سواء مني أو من زملائي، مما جعل التجربة ثرية للغاية.
من الحاجات اللي لفتت انتباهي في الكورس هو تميز المهندس وليد بمهاراته في الإلقاء، قدرته على جذب الانتباه طوال الجلسات، وكمان تحفيزه المستمر للمشاركين. الطريقة اللي بيشرح بيها والمواقف الواقعية اللي كان بيناقشها بتخلي الموضوع مش مجرد معلومات جافة، بل تجربة تفاعلية ومشوقة. دا كان بيفرق جدًا في استيعاب المحتوى وتحفيزنا كلنا إننا نطبق اللي بنتعلمه.
الدبلومة مش بس لحد عاوز يبدء مشروع جديد، ولكنها مفيدة لأي شخص يريد تحسين مهاراته في البيزنس. لكن محتاجة منك تكون مجتهد ومنظم في وقتك لتحصل على الفائدة الكاملة.
بشكل عام، الدبلومة كانت تجربة مثمرة وممتعة وغنية، وأثرت بشكل كبير على مهاراتي ومعرفتي، وأوصي بها لأي شخص يبحث عن التميز في ريادة الأعمال.
بشكر م وليد جدا، وممتن ليه ولزملائي جميعا، وسعيد جدا بالتعرف عليهم، وبتشرف بصحبتهم، وأسأل الله العظيم أن يجعل ما تعلمناه في ميزان حسناتنا جميعاً، وأن يديم الود بيننا، وأن ويجمعنا على الخير دوما، وأن يرزقنا العلم والفهم والإخلاص والعمل، وأن يعلمنا ما ينفعنا، وأن ينفعنا بما علمنا، وأن يزيدنا علما.
`,
            client: `احمد الشاوري`,
            postLink: `https://www.facebook.com/story.php?story_fbid=2225698261121474&id=100010439648534&rdid=rJWg4NGG70JT2L2F`,
            img: ahmedAlshawr
        },
        {
            post: `في خلال الـ 6 شهور اللي فاتوا، كنت محظوظ جدًا إني شاركت في واحدة من أحسن الدبلومات اللي أثرت بشكل كبير في حياتي - دبلومة ريادة الأعمال مع المتميز المهندس Walid Elhanbly . أكتر حاجة أثرت فيا في الدبلومة هي إني اتعرفت على مجتمع مهتم بريادة الأعمال والمشاريع الصغيرة والمتوسطة.
كمان الدبلومة فتحتلي أبواب جديدة على مستوى الشغل، وقدرت أكتسب نظرة أوسع وأشمل عن عالم التسويق والإعلانات. اتعلمت إزاي أحلل السوق كويس جدًا، وأشوف احتياجات العملاء واتجاهاتهم، وده ساعدني جدًا في تحديد الجمهور المستهدف بشكل أدق، وتطوير استراتيجيات تسويقية فعالة تناسب احتياجاتهم. كمان اتعلمت إزاي أبني خطط تسويقية تتماشى مع التغيرات في السوق، وده خلاني أكون أكتر كفاءة في تصميم استراتيجيات تسويق ناجحة.
في التسعير والمبيعات، بقى عندي فهم أكتر إزاي أقدر أسعّر منتجاتي أو خدماتي بشكل استراتيجي بناءً على القيمة المضافة اللي بقدمها، وده ساعدني على زيادة المبيعات. كمان اتعلمت طرق مبتكرة لتطوير استراتيجيات بيع تزيد فرص البيع وتزود الربحية.
على مستوى خدمة العملاء، اتعلمت إزاي أقدم تجربة عميل استثنائية من أول تفاعل مع العميل لحد خدمة ما بعد البيع، وده مش بس بيزيد ولاء العملاء، لكن كمان بيعزز سمعة المشروع وبيزود فرص النجاح على المدى الطويل.
كمان، في إنشاء المحتوى، اتعلمت إزاي أكتب محتوى مميز وجذاب يتماشى مع أهداف المشروع والجمهور المستهدف. بقى عندي قدرة إني أعمل حملات تسويقية بمحتوى قيم يجذب العملاء ويقوي علاقتي بيهم على المدى البعيد.
واحدة من أكتر الحاجات المفيدة كانت اتخاذ القرارات الاستراتيجية. اتعلمت إزاي أحلل البيانات وأخد قرارات مدروسة بتأثر بشكل إيجابي على نجاح المشروع في المستقبل. بجانب تطوير مهارات القيادة، بقت عندي قدرة إني أنظم الفرق بشكل أفضل، وأحدد أهداف واضحة تساعدني على تحقيق النجاح.
وأخيرًا، بقى عندي فهم أكتر لإدارة العمليات التجارية بشكل سلس وفعال، وده ساعدني في تحسين كفاءة الشغل وتقليل التكاليف. وكمان اكتسبت مهارات متقدمة في إدارة الحملات الإعلانية على فيسبوك، وبقيت أعرف إزاي أعمل وأدير حملات إعلانية ناجحة تستهدف الجمهور المناسب وتحقق أفضل النتائج.
والجميل في الكورس إنه مش مجرد كلام نظري، بالعكس، المدرب كان دايمًا بيشاركنا أمثلة حقيقية من واقع تجاربه مع شركاته السابقة والحالية زي Click Laptop، Giftneers، وTekatech. دي أمثلة كانت بتساعدنا نفهم أكتر إزاي نطبق اللي بندرسه في مواقف حقيقية.
كمان الكورس مش بيقتصر على تقديم المعلومة وبس، هو بيشتغل على تغيير الــmindset للشخص بشكل فعال جدًا قبل ما تبدأ تتلقى المعلومة، وده بيخليك جاهز تفكر بطريقة مختلفة وأحسن.
وكمان، الكورس بيساعد على تطوير المهارات بشكل عملي جدًا، مش بس عن طريق النظريات، لكن من خلال المهام المطلوبة بعد كل جزء. المدرب كان بيكلفنا بمهام نطبق فيها اللي درسناه، وبيتم مراجعتها وتعديلها لو لزم، وده ساعدني أطور مهاراتي بشكل فعال جدًا."
أنصح أي حد مهتم بتطوير مشروعه الخاص أو إنه يدخل عالم ريادة الأعمال إنه ياخد الخطوة دي، لأنها كانت نقطة تحول كبيرة في مسيرتي الشخصية والمهنية."
`,
            client: `محمد رضا`,
            postLink: `https://www.facebook.com/story.php?story_fbid=3471438089667398&id=100004037242368&rdid=1Ofzmps4p6KyFLW2`,
            img: mohamedReda
        },
        {
            post: `لصنا أم الكورس خلاص 😂💔
أنا هقول كل الي جوايا والي يحصل يحصل. 
نصيحة لوجه الله، لأنه شريكي في Giftneers وبقولك عن تجربة شخصية..
 اياك تخسر وقت ومجهود وفلوس مع Walid Elhanbly في الكورسات الي بيعملها، ده عشان كذا سبب حصلوا في كورس الـ Besiness..
1.. عنده ضمير في الشرح = هتقعد معاه في السيشن الواحده من ٨ لـ ١٠ ساعات عشان يديك كل حاجه حرفيا.
2.. هيقولك هنخلص اهو اوعى تصدقه.
3.. لو مفهمتش هيعيد، لو مفهمتش هيجيب مثال، لو مفهمتش هيشرحلك لوحدك = المهم تطلع فاهم.
4.. اهم شيء بعد العلم النظري التطبيق العملي = هيساعدك خطوة بخطوة ومش هيبخل عليك بوقته ومجهوده.
5.. اقرأ 2 تاني.
6.. الكورس دسم ومحتواه قوي، ومحتاج منك متابعه ومذاكره علطول. 
ده على سبيل المثال وليس الحصر...
باختصار الكورس مع وليد محتاج رجالة عشان تكمل للآخر، فإياك تخسر وقت ومجهود وفلوس لو مش هتبقى قدها🚶
*لقد هرمنا والله*`,
            client: `عبد الرحمن الصياد`,
            postLink: `https://www.facebook.com/story.php?story_fbid=2522178341258501&id=100003990784055&rdid=Mm9LuNhuZkQZfzhr`,
            img: AbdAlrahmanAlsyad
        },
        {
            post: `اسوأ عرض ممكن تقدمه لعميلك هو الجودة 
عشان دا حقه مش value 🤷🏻‍♀️
طب ازاي اطلع فاليو؟ 🤔
- حل مشكلة حقيقية فعلا عند العميل 
و بعدين بيعله الحل اللي هو محتاجه باللي هو عايزه. 
- دا اختصار لخطوة واحدة من خطوات كتير اتعلمناها في الكورس عشان نقدر في الاخر نعمل Business ناجح فعلا مش سبوبة 😁
▪️ و لما تروح الكورس ماتنساش ان اي حاجة مهمة بنراكمها على مر الزمن بتكون النهاية غير سعيدة عشان السيشنز اللي غيبناها و ماذكرنهاش بنعيط من كمية طول الريكوردات المهمة بتاعتها دلوقتي 😭
- شكرا جدا انك اديتنا كل المعلومات اللي عندك و شكرا انك خلتنا منافسين ليك في السوق 🤍`,
            client: `منه الصاوي`,
            postLink: `https://www.facebook.com/story.php?story_fbid=1834354343566061&id=100009745392768&rdid=CXewSzluNWIMQqVf`,
            img: mennaAlsawy
        },
        {
            post: `" تجدد او تبدد "
سبب فشل القادة من تحقيق النجاح مش افتقارهم لمهارة القيادة  لكن لانهم مش بيغيروا من اساليبهم القديمة حتى لو مش بتجيب نتيجة 
علشان كده دورك كقائد انك تطور دايما من نفسك ومن الناس اللي انت مسؤول عنهم بما يناسب تحقيق الهدف 
لانك عندما تتوقف عن التعلم ستفشل في القيادة
- لازم تتعلم ازاي تدير الفريق بتاعك وتعامل موظفينك كبشر وليس كعاملين وتتقي الله في الناس اللي بتديرهم  
وكمان تشجعهم وتحفزهم انهم يكونوا اشخاص احسن لان كل ده في الاخر هيعود عليك وعلى سير العمل بالايجاب     
كل ده هتعرفه في دبلومة ال leadership & management  اللي بيقدمها بشمهندس  Walid Elhanbly  
- كمان هتعرف ازاي تتخطى رهبة المسرح وتتحكم في توترك وانت بتتكلم قدام عدد كبير من الناس 😌
-وازاي تخطط لحياتك واهدافك بناء على أسس وقواعد مجربة وفعالة
-ازاي تختار الموظفين ؟ 🧍 وايه المعايير اللي انت بختار على أساسها؟  وامتى تقرر انك تاخد قرار رفد موظف من غير ما تظلمه 
- واخيرا وليس اخرا اوقات كتير هيحصل تفاعلات صعبة بين الموظفين وبعضهم او بينك وبين الموظفين، دورك كقائد انك تدير التفاعلات دي بحكمة وتحلها 🤝 
في النهاية احب اشكر بشمهندس وليد على طريقته البسبطة في توصيل المعلومة مهما كانت صعبة هيفضل وراك لغاية ما تفهمها وده لانه فعلا بيحب الحاجة اللي بيعملها♥️
مهما اتكلمنا مش هيوفيك حقك بجد لانك بتعلمنا حاجات كتير جدا اكتر من مجرد كورس 🙏
وكفاية اصلا انك استحملت الدفعة بتاعتنا دي واسألتها اللي برا الموضوع اصلا مش برا الصندوق بس 🤣🤣🤣
 وتنمر منه على البرزنتيشن 😂😂😂😂
واسفين على اننا توبناك عن اكتر حاجة بتحبها 😅😆😆
ملحوظة : 🚫
اوعى اوعى اوعى متطبقش اللي بتاخده 
في آخر الكورس هتعرف ليه `,
            client: `نهال السيد`,
            postLink: `https://www.facebook.com/story.php?story_fbid=3714496158782909&id=100006676837225&rdid=3IHsz2XSpbcskpui`,
            img: nehalElsaied
        },
        {
            post: `أن تفكر كقائد وأن تحكم كملك وأن تعمل كعبد😅
الحمدلله بعد ٤ شهور بدون إجازة عشان الكورس يوم الجمعة 🥲😂 خلصنا دبلومة الإدارة مع بشمهندس وليد 
استفدت كتير من الكورس خاصة جزء ال leadership وفرق معايا جدا فالتعامل مع التيم وقدرنا نحقق التارجت ٤ شهور على التوالي
دا غير ال presentation skills, hiring, operation management وحاجات حلوة كتير😂❤️
الكورس مفيد الصراحة لحد عنده خبرة عملية سنة او اتنين وبيدور على حاجة تثقل مهاراته وتلملم شتات دماغه 😅
شكرا يصديقى على المحتوى الجامد دا وربنا يوفقك ويكرمك فاللي جاي إن شاء الله🫡❤️
 #الباش_ماركتير`,
            client: `احمد همام البيلي`,
            postLink: `https://www.facebook.com/story.php?story_fbid=340112368669874&id=100080133402099&rdid=xqAlTsvRxL0EcFkp`,
            img: AhmedHmam
        },
        {
            post: `نباركله ؟! 
محمد حبيب ❤
مهندس ميكانيكا، رجل مجتهد وذكي جدا، وبيتشقلب الحقيقه، وباذن الله هيكون ليه مستقبل كبير 💪
محمد دخل معايه الكورس من ٣ شهور، وفي دماغه افكار لكذا بيزنس مختلف، كان مذاكر عن كل حاجه حاجه ومراقب منافسين، وعارف موردين وفي دماغه افكار للتنفيذ .
بعد شهرين ونص من حضور السيشنات، والتعرف على زمايله في الكورس، وبعد النقاشات اللي دارت بيننا، والافكار اللي طلعلنا بيها، 
وبعد مجهود محمد في الحضور والمذاكره والتفكير والتحليل ... محمد بدأ البراند بتاعه  في مجال ال furniture وسماه 👈 ( أوضه وصاله ) .
مش ده بس الخبر الحلو، الخبر الحلو انه ومن قبل مالكورس حتى يخلص ب 2 session محمد الحمد لله  بيحتفل بأول صفقه ليه في البراند الجديد بتاعه 😎
ودي كانت هديته المتواضعه على بذله،  وعلى اول client ليه  : كوتلر يتحدث عن التسويق.
رحبوا بمحمد، واتمنوله التوفيق،وقولوله ألف مبروك ^^ `,
            client: `محمد حبيب`,
            postLink: `https://www.facebook.com/story.php?story_fbid=1774128402921989&id=100009745392768&rdid=v0lCfHL74OqThbza`,
            img: mohamedHabib
        },
        {
            post: `رحله بدأناها من ٥ شهور 
رحله مليئه ب"ده انتوا متدربين ملط" 
رحله مليئه ب"ابقوا قابلوني لو حد عمل التاسكات"
رحله مليئه بالمتعه والتعليم الحقيقي العملي منه والنظري 
رحله مليئه بالتهزيق بصراحه 😂
ما هو بصراحه بقا يا Walid Elhanbly  انا متهزقتش كده فحياتي 😂
بس رغم المده الطويله وال٦ ساعات الي بنقعدهم والجمعه الي مبناخدهاش اجازه ولا بنلحق نزاكر ولا نعمل حاجه بس انا استفدت ... اه والله العظيم استفدت 
لسه بفكر الجمله الي قلتهالك اول ما عرفت الي هيبقوا معانا في الكورس "الشباب دول كلهم أساساً ليدرز في مكانهم وشطار وعندهم إمكانيات واكيد هيحصل بينهم خلافات، هتفضها ازاي؟" ساعتها قولتلي لو معرفتش يبقي مستحقش اديك الدبلومه وخد فلوسك تاني 
بصراحه انت عرفت وعلمتني ازاي اعمل ده كويس بس بصراحه برضو انا عاوز فلوسي عشان مفلس 🥺
يرضيك تلميذك الشاطر النجيب الي مبيفوتش تاسك ولا كتاب من الي بتدهوله كل سيشن ولا بيفوت اي برايفت سيشن أو استشاره سواء نفسيه او مهنيه أو بيزنيس يبقي مفلس؟ 
وليد: اه يرضيني عادي 😎
حقيقي شكرا علي الفتره دي وانك مكنتش بتسيبنا وبتحاول تطور من نفسك عشان تفيدنا اكتر وتدينا معلومات احسن وتطورنا وحقيقي انا اتطورت جامد في الفتره الي فاتت دي سواء علي المستوي الشخصي أو المهني `,
            client: `حسان صفي الدين`,
            postLink: `https://www.facebook.com/story.php?story_fbid=6765287846911789&id=100002919225676&rdid=ddIh5ubOihF6TJud`,
            img: hossam
        },
        {
            post: `"ليس السلاح ولكنه الساعد يا أمير المؤمنين"
اتعلمت انك بدماغك ومهارات تقدر تشقلب الدنيا زي ما تحب.
 اكتر المهارات الل اتعلمتها حاجة منك شخصيا Walid Elhanblyبعيدا عن محتوي الكورس وهي طريقة الإلقاء الممتعة وازاي تستولي علي انتباه واهتمام الناس وتحببهم في حاجة هما واخدين عنها فكرة غلط...
استفدت من المحتوي ككل المحتوي تقيل جدا ومحتاج مجهود كبير علشان تذاكره وتتعلم وتطبق كمية المعلومات والمهارات الل فيه. بجد اتقل محتوي ممكن تشوفه المعلومات وتطبيقها العملي علي أرض الواقع.
استفادي انا الشخصية من الكورس انو غير عندي مفاهيم مغلوطة عن البيزنس والتسويق زي مثلا لازم يكون معاك فلوس انك تبدأ بيزنس بس معاك Walid Elhanbly طبعا الفكرة دي اتغيرت عندي.
حرفيا الكورس نقلني لحتة تانية خالص في التفكير والتخطيط والصبر علي التعلم وتطبيق المعلومات الل اتعلمتها معاك Walid Elhanbly
اتعلمت مهارات كتير واكتر حاجة شدتني واتعلمتها مهارات السيلز الكتير في الكورس ولسه بتعلم فيها حاجة زي مبدأ التباين وسيكولوجية تدرج حالة العميل من عميل مش بيفكر في منتجك اصلا الي انك تخليه مش يشتري غير منك انت. 
 حاجة كمان ان التسويق مش مجرد اعلان وبوست علي الفيس واهبد وخلاص. اهم معلومة طلعت بيها من الكورس أن "العميل حيث يبدأ وينتهي كل شيئ في البيزنس.
شكرا ليك جدا يا وليد علي كل لحظة وكل وقت وكل فرصة جمعتني بيك.
واسال الله لك قبول العمل و أعلي الدرجات من الجنان وراحة البال وسلامة الصدر والنجاة من النار وأن يرزقك فهم النبيبن وعمل المرسلين وصدق الصديقين .
`,
            client: `محمد العربي`,
            postLink: `https://www.facebook.com/story.php?story_fbid=2463138480504268&id=100004244191465&rdid=mhLrcFoHyMX1Bui2`,
            img: mohamedAlAraby
        },
        {
            post: `جيت أعد الكورسات اللي أخدتها في التسويق والبزنس لقيتهم أكتر من 20 مابين الأوف لاين والأون لاين  منهم الساعتين ومنهم ال60 ساعة
محصلش إني أخدت كم الاستفادة دي والأفكار الكتير اللي اتغرقت بيها بجد
معروف عن المدربين إنهم بيسيبوا حتة تقيلة عندهم مش بيعلموها للناس عشان يفضلوا هما التقال
هو كان بيهتم يدينا الحتة دي بشكل خاص
ازاي تبقى محترف، وتعديني (بس عابال ما نعدي مستواه دلوقتي هايكون بيطلع نار من بقه بقى غالبا)
ربنا يبارك في مجهودك وعمرك وعلمك يا صديقي ومدربي الغالي⁦❤️`,
            client: `اشرف رفعت`,
            postLink: `https://www.facebook.com/story.php?story_fbid=5251987838233715&id=100002676522211&rdid=UfkWFyYNEmwfRjte`,
            img: AshrafRefaat
        },
        {
            post: `علم وعمل .
عندما يركز الإنسان على العمل فإنه يتحول الى ألة. 
وعندما يركز على العلم دون عمل فإنه يتحول الى مسجل يعيد ويزيد بوعى وبدون وعى .
وعندما يجتمع العلم مع العمل فإن الإنسان يتحول الى قنبله موقوته مستعده لتفجر أقصى طاقتها من أجل تحقيق أهدافها .
وهذا مايحدث عندما تتعلم مع الباشمهندس وليد ،💫.
تحياتى .`,
            client: `داليا عمر`,
            postLink: `https://www.facebook.com/story.php?story_fbid=835723070752679&id=100029449821969&rdid=RUC1V3kMjJLUdWPy`,
            img: DalaiOmar
        },
        {
            post: `وليد الحنبلي .. المستشار المؤتمن 
يقولك الاستشارة ٣ ساعات بالكتير .. ماتصدقوش هيقعد معاك بالست ساعات 😅
بس هو اللي خسران !
انت بتستفيد من تجاربه وقراءته الواسعه ما شاء الله في الإدارة والبيزنس وعلم النفس .. وهو بس قاعد معاك لحد ما انت اللي تقوله كفاية دماغي لف خلاص 🙃
بس هو عايش علشان يحقق الحديث دا "خير الناس أنفعهم للناس" فدا مكسبه بإذن الله 
استشارة بتاخد فيها على الجاهز خبرة محترمة مدفوع فيها سنين عمر تجارب ومشاكل وتعب ، وبتاخد فوائد من كتب ودورات ثمنها ألفات ! 
الاستشارة معاه بتأكدلك إنك محتاج دائما حد معاك سميه بقى ثيرابست ، تسميه لايف كوتش ، تسميه صديق مخلص أو أخ كبير .. اي حاجه المهم محتاج حد يقولك توجه الدفة إزاي ، وكل دا مجهود كبير منه علشان يصحح فكرة غلط اتزرعت بسبب (أفورة) مدربين التنمية البشرية!
مش اول مرة اقعد معاه واستفيد منه ، ياما ما شاء الله ساعدني كتييير ايام الكلية وبعدها حتى
ببقى ممتن ومش عارف ارد الجميل إزاي !`,
            client: `ايمن ابو بكر`,
            postLink: `https://www.facebook.com/story.php?story_fbid=2307261129608711&id=100009745392768&rdid=SJ74LxrQSJyZgcXU`,
            img: AimanAboBakr
        },

    ]
    const vedioData = [
        {
            ved: <iframe src="https://www.youtube.com/embed/Y8JIgOI0xJc" title="alaa mohammed business developer  at e commerce field and former sales manager realstate field" frameBorder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerPolicy="strict-origin-when-cross-origin" allowFullScreen></iframe>
        },
        {
            ved: <iframe src="https://www.youtube.com/embed/y5xT3Zw7F5U" title="Menna elsawy Digital marketing manager  Businessly agency" frameBorder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerPolicy="strict-origin-when-cross-origin" allowFullScreen></iframe>
        },
        {
            ved: <iframe src="https://www.youtube.com/embed/ceqhdXlxI2w" title="Eng Abdelrhman Alsayad business developer and medical business owner" frameBorder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerPolicy="strict-origin-when-cross-origin" allowFullScreen></iframe>
        },
        {
            ved: <iframe src="https://www.youtube.com/embed/lxaQi2jFZp0" title="Reham yoseef digital marketer" frameBorder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerPolicy="strict-origin-when-cross-origin" allowFullScreen></iframe>
        },
        {
            ved: <iframe src="https://www.youtube.com/embed/1bAsIsomvPE" title="Eng Mohammed Albanna Media buyer specialist &amp; co founder businessly agency" frameBorder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerPolicy="strict-origin-when-cross-origin" allowFullScreen></iframe>
        },
        {
            ved: <iframe src="https://www.youtube.com/embed/HY0FE4U9u34" title="eng Mohammed Elaraby business developer" frameBorder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerPolicy="strict-origin-when-cross-origin" allowFullScreen></iframe>
        },
        {
            ved: <iframe src="https://www.youtube.com/embed/cVVnFuzoG4E" title="صافي جمال  مديرة مستريات سلسلة مطاعم المحمدي" frameBorder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerPolicy="strict-origin-when-cross-origin" allowFullScreen></iframe>
        },
        {
            ved: <iframe src="https://www.youtube.com/embed/etwTBdJ8OaI" title="hassan safaaeldeen" frameBorder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerPolicy="strict-origin-when-cross-origin" allowFullScreen></iframe>
        },
        {
            ved: <iframe src="https://www.youtube.com/embed/RDv467yjfYM" title="dr ahmad hmam media buyer team leader at azzrak company" frameBorder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerPolicy="strict-origin-when-cross-origin" allowFullScreen></iframe>
        },
        {
            ved: <iframe src="https://www.youtube.com/embed/6GNc7n_6enA" title="Eng Mahmoud Mounir mechatronics engineer and business owner cpo at tekatech" frameBorder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerPolicy="strict-origin-when-cross-origin" allowFullScreen></iframe>
        }, {
            ved: <iframe src="https://www.youtube.com/embed/yz2H9SY1yb4" title="nehal eldaeid Nehal Elsaied media buyer team leader" frameBorder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerPolicy="strict-origin-when-cross-origin" allowFullScreen></iframe>
        },
        {
            ved: <iframe src="https://www.youtube.com/embed/yQfjW2P7zAA" title="يوسف الحسيني رائد أعمال مقيم بسلطنة عمان" frameBorder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerPolicy="strict-origin-when-cross-origin" allowFullScreen></iframe>
        }
    ]
    const [showAll, setShowAll] = useState(false);
    const [showAllVed, setShowAllVed] = useState(false);


    const initialVisibleCount = 4;
    const toggleShowAll = () => {
        setShowAll(!showAll);
    };
    const toggleShowAllVed = () => {
        setShowAllVed(!showAllVed);
    };
    const itemsToShow = showAll ? data : data.slice(0, initialVisibleCount);
    const itemsToShowVed = showAllVed ? vedioData : vedioData.slice(0, initialVisibleCount);
    return (
        <section id="feedback" className='container mx-auto py-7 px-6 border-t-2'>
            <div className="flex items-center mb-6 bg-[#B8DFF4] w-fit text-xl lg:text-5xl py-3 px-6 rounded-md mx-10" >

                <h1> فيدباك العملاء</h1>
            </div>
            <div className="flex flex-col items-center mb-10">
                <h1 className='text-center text-4xl bg-[#0380C0] w-fit px-3 py-2  text-white rounded-md mb-8'>VEDIOS</h1>
                <div className="grid grid-cols-1 sm:grid-cols-2  lg:grid-cols-3 xl:grid-cols-4 gap-6 ">
                    {itemsToShowVed.map((vedio, idx) => (
                        <div className="bg-white rounded-md shadow-md hover:shadow-sm hover:scale-105 transition-all duration-300 " key={idx}>
                            {vedio.ved}
                        </div>
                    ))}
                </div>
                {vedioData.length > initialVisibleCount && (
                    <button className='bg-[#FFCC00] text-white px-4 py-2 rounded-full text-2xl mt-8' onClick={toggleShowAllVed} >{showAllVed ? "شاهد اقل" : "شاهد المزيد"}</button>
                )}
            </div>
            <div className="flex flex-col items-center">
                <h1 className='text-center text-4xl bg-[#0380C0] w-fit px-3  py-2  text-white rounded-md mb-8'>POSTS</h1>
                <div className="grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 lg:grid-cols-4 gap-6">
                    {itemsToShow.map((post, idx) => (
                        <div className="bg-white rounded-md shadow-md hover:shadow-sm hover:scale-105 transition-all duration-300" key={idx}>
                            <img src={post.img} className="h-48 w-full  rounded-t-md" alt="" />
                            <div className="p-3">
                                <h2 className="text-center font-bold">{post.client}</h2>
                                <h3 className="inline">{post.post.split(' ').slice(0, 28).join(' ')} </h3>
                                <a href={post.postLink} className="text-blue-500 underline" target="_blank">شوف باقي البوست</a>
                            </div>

                        </div>
                    ))}
                </div>


                {data.length > initialVisibleCount && (
                    <button className='bg-[#FFCC00] text-white px-4 py-2 rounded-full text-2xl mt-8' onClick={toggleShowAll} >{showAll ? "شاهد اقل" : "شاهد المزيد"}</button>
                )}
            </div>
        </section>
    )
}
